WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/DocLitW/SoapWsdl.BaseDataTypes.XmlFormatter.DocLitWrapped_RetDecimal_Client_Request-8.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesDocLitW/RetDecimal</a:Action>
    <a:MessageID>urn:uuid:6c047df0-7b85-42a4-8a8a-4e24462c7ca1</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetDecimal xmlns="http://tempuri.org/">
      <inDecimal>0.61803398874989484820458683</inDecimal>
    </RetDecimal>
  </s:Body>
</s:Envelope>